#language: ru

  Функционал: Домашняя работа 2

    @homework2
    Сценарий: Chrome Выбор специализации по названию
      Пусть Я открываю браузер Chrome
      Если Я открываю главную страницу
      И Я выбираю специализацию QA Automation Engineer
      Тогда Открылась страница курса QA Automation Engineer

    @homework2
    Сценарий: Firefox Выбор специализации по названию
      Пусть Я открываю браузер Mozilla Firefox
      Если Я открываю главную страницу
      И Я выбираю специализацию Системный аналитик
      Тогда Открылась страница курса Системный аналитик